{
  "_name_or_path": "google-bert/bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Improvement Suggestions",
    "1": "Questions",
    "2": "Confusion",
    "3": "Support Request",
    "4": "Discussion",
    "5": "Course Comparison",
    "6": "Related Course Suggestions",
    "7": "negative",
    "8": "positive"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Confusion": 2,
    "Course Comparison": 5,
    "Discussion": 4,
    "Improvement Suggestions": 0,
    "Questions": 1,
    "Related Course Suggestions": 6,
    "Support Request": 3,
    "negative": 7,
    "positive": 8
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.39.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
